openfoam_cases/case1/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces1
{
    type            forces;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;
    

    patches         (coin);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1;           // Redundant for incompressible
    // liftDir         (0 0 1);
    // dragDir         (1 0 0);
    CofR            (0.0 0 0);  // Axle midpoint on ground
    pRef 0;
    // pitchAxis       (0 1 0);
    // magUInf         20;
    // lRef            1.42;        // Wheelbase length
    // Aref            0.75;        // Estimated
    /*
    binData
    {
        nBin        20;          // output data into 20 bins
        direction   (1 0 0);     // bin direction
        cumulative  yes;
    }
    */
}


// ************************************************************************* //
