openfoam_cases/case1/Allprep
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

mkdir -p constant/triSurface
# Copy motorbike surface from resources directory
# cp $FOAM_TUTORIALS/resources/geometry/motorBike.obj.gz constant/geometry/
python geom_gen_coin_only.py
runApplication surfaceFeatures

runApplication blockMesh

runApplication decomposePar -copyZero
runParallel snappyHexMesh -overwrite


#------------------------------------------------------------------------------
