openfoam_cases/case1/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runParallel patchSummary
runParallel potentialFoam
runParallel $(getApplication)

runApplication reconstructPar -latestTime